# Basic English Vocabulary
# Description: Common words for beginner English learners (A1-A2 level)
# Creator: English Word Atlas
# Tags: beginner, ESL, vocabulary, learning
# Size: 532 words
#
a
able
about
act
afraid
after
again
agent
ago
ahead
air
alive
all
almost
alone
along
also
always
am
an
answer
any
are
around
as
ask
at
away
baby
back
bad
ball
be
beat
become
bed
been
before
behind
being
believe
best
bet
better
between
big
bill
bit
black
blood
blue
body
book
boss
both
boy
break
bring
brother
business
busy
but
buy
by
bye
call
came
can
captain
car
care
careful
case
catch
cause
chance
change
changed
check
child
christmas
city
class
clean
clear
close
clothes
coffee
cold
come
coming
control
cool
country
couple
course
court
crazy
cut
dad
damn
dance
date
daughter
day
dead
deal
dear
death
did
die
dinner
do
doctor
does
dog
doing
done
door
down
dream
drink
drive
drop
each
early
easy
eat
either
end
enough
even
evening
ever
except
excuse
expect
explain
eye
face
fact
fall
far
fast
father
fault
feel
feeling
few
fight
figure
find
fine
fire
first
five
floor
follow
food
forget
found
four
free
friend
front
full
fun
funny
future
game
gave
get
getting
girl
give
giving
glad
go
god
goes
going
gone
good
got
great
guess
gun
guy
had
hair
half
hand
handle
hang
happen
happy
hard
has
hate
have
having
he
head
hear
heart
hell
hello
help
here
hi
high
hit
hold
home
honey
hope
hot
hotel
hour
house
human
hurry
hurt
husband
i
in
inside
is
it
its
job
just
keep
kid
kill
kind
king
kiss
know
lady
last
late
later
law
learn
least
leave
left
less
let
lie
life
light
like
line
listen
little
live
living
long
look
lord
lose
lost
lot
love
luck
lucky
lunch
mad
made
major
make
making
man
many
married
marry
matter
may
maybe
me
mean
means
meet
meeting
might
million
mind
mine
minute
miss
mistake
mom
moment
money
more
morning
most
mother
mouth
move
movie
moving
much
murder
music
must
name
need
never
new
news
next
nice
night
no
none
not
nothing
now
number
off
office
ok
okay
old
on
once
one
only
open
or
order
other
out
outside
over
own
paper
part
party
pass
past
pay
people
perfect
perhaps
person
phone
pick
picture
piece
place
plan
play
playing
please
point
police
poor
power
pretty
problem
promise
pull
put
question
quick
quiet
quite
rather
re
read
ready
real
really
reason
red
report
rest
ride
right
road
room
run
safe
said
same
save
saw
say
saying
school
second
secret
see
seeing
seem
seen
send
sense
sent
set
seven
sex
shoot
shot
show
shut
sick
side
sign
sir
sister
sit
six
sleep
small
so
some
someone
sometimes
somewhere
son
soon
sorry
sort
sound
speak
special
stand
start
state
stay
step
still
stop
story
straight
street
stuff
stupid
such
suppose
sure
sweet
table
take
taken
taking
talk
team
tell
ten
thank
then
there
thing
think
thinking
though
thought
three
through
throw
till
time
times
tired
today
tonight
too
took
top
touch
town
trouble
true
trust
truth
try
turn
two
uncle
under
up
us
use
used
very
wait
waiting
wake
walk
want
war
was
watch
water
way
wear
week
weird
welcome
well
went
were
while
white
who
whole
why
wife
will
win
wish
woman
wonder
word
work
working
world
worry
worth
write
wrong
yeah
year
yes
yet
young
